yannlossouarn/mowglinext/firmware/stm32/ros_usbnode/src/ros/ros_custom/cpp_main.cpp
/* Per-wheel loop selector, runtime-tunable via PKT_ID_SET_DRIVE_PID (replaces
 * the compile-time USE_WHEEL_PI switch so the open-loop vs closed-loop A/B no
 * longer needs a reflash). Seeded with the compile-time default. */
static volatile uint8_t g_use_wheel_pi = (uint8_t)USE_WHEEL_PI;

/* Standstill position hold (runtime-tunable via PKT_ID_SET_DRIVE_PID). While
 * the robot is actively controlled (not IDLE / not emergency) and commanded to
 * ~0 velocity, the loop latches the encoder position and pushes back against
 * creep instead of coasting — fixing the backlash/tire-windup back-creep that
 * walks the heading off after a pivot. Released (coast) only when really idle.
 * g_hold_kp is PWM per tick of position error; the breakaway (g_drive_deadband_
 * pwm) supplies the static-friction floor so a small error can still correct. */
static volatile uint8_t g_hold_enabled = 1u;
static volatile float g_hold_kp = 4.0f;
/* Hold deadzone (ticks) and output clamp (PWM). A tick is ~3.3 mm; tolerate a
 * couple before correcting so quantization noise doesn't buzz the motors, and
 * clamp the corrective PWM well under the motion range. */
#define HOLD_TOL_TICKS  2
#define HOLD_MAX_PWM    120.0f

/* ---------------------------------------------------------------------------
 * IMU-to-odometry discrepancy detector
 * ---------------------------------------------------------------------------
 * Flags stick-slip / wheel-slip / impact from the residual between the chassis
 * yaw rate the WHEEL ENCODERS imply ((v_r - v_l)/WHEEL_BASE) and the one the IMU
 * GYRO measures, plus a stall flag when a real velocity is commanded but the
 * wheels aren't turning (obstruction / collision / deadband stall). Computed in
 * wheelTicks_handler at the ~50 Hz odom cadence; the raw rates + flags ride the
 * drive-telem packet so the host can take its own residual / threshold too.
 *
 * The gyro here is RAW (the host bias-corrects); a ~0.05 rad/s raw bias sits well
 * under the yaw threshold, and an EMA + a few-sample debounce reject transients.
 * Thresholds are deliberately gross — this is a flag, not a precise estimator. */
#define SLIP_EMA_ALPHA       0.3f   /* low-pass on |yaw residual| */
#define SLIP_YAW_THRESH_RPS  0.35f  /* |wheel yaw − gyro yaw| flag threshold [rad/s] */
#define SLIP_YAW_PERSIST     3u     /* consecutive samples over threshold to latch */
#define STALL_CMD_MPS        0.08f  /* commanded |wheel speed| considered "moving" */
#define STALL_MEAS_MPS       0.02f  /* measured |wheel speed| considered "stopped" */
#define STALL_PERSIST        5u     /* consecutive samples to latch a stall */

/* Latest raw IMU yaw rate [rad/s], published by broadcast_handler, read by the
 * detector in wheelTicks_handler. Single-writer/single-reader, both on the main
 * loop — volatile is belt-and-suspenders. */
static volatile float g_imu_gyro_z = 0.0f;
/* Detector outputs (read by the drive-telem builder in motors_handler). */
static volatile int16_t g_wheel_yaw_mrad_s = 0;
static volatile int16_t g_imu_yaw_mrad_s = 0;
static volatile uint8_t g_slip_flags = 0u;

/* ---------------------------------------------------------------------------
 * Blade motor control state
 * ---------------------------------------------------------------------------*/
static volatile uint8_t target_blade_on_off = 0;
static uint8_t blade_on_off        = 0;
static uint8_t blade_direction     = 0;

/* ---------------------------------------------------------------------------
 * cmd_vel timeout tracking (replaces ros::Time)
 * ---------------------------------------------------------------------------*/
static volatile uint32_t last_cmd_vel_tick = 0;

/* ---------------------------------------------------------------------------
 * High-level state received from host
 * ---------------------------------------------------------------------------*/
static uint8_t hl_current_mode = 0;
static uint8_t hl_gps_quality  = 0;

/* ---------------------------------------------------------------------------
 * Heartbeat watchdog
 * ---------------------------------------------------------------------------*/
static volatile uint32_t last_heartbeat_tick   = 0;
#define HEARTBEAT_TIMEOUT_MS 2000u

/* ---------------------------------------------------------------------------
 * Reboot flag
 * ---------------------------------------------------------------------------*/
static bool reboot_flag = false;

/* ---------------------------------------------------------------------------
 * Non-blocking timers
 * ---------------------------------------------------------------------------*/
static nbt_t motors_nbt;
static nbt_t panel_nbt;
static nbt_t imu_nbt;
static nbt_t status_nbt;
static nbt_t led_nbt;
static nbt_t blade_nbt;

/* ---------------------------------------------------------------------------
 * Odometry timing
 * ---------------------------------------------------------------------------*/
static uint32_t last_odom_tick = 0;

/* Forward declarations */
static void update_blade_led(void);
static void update_slip_detector(int16_t left_v_mm_s, int16_t right_v_mm_s);

/* ---------------------------------------------------------------------------
 * COBS packet handlers (Host -> Firmware)
 * ---------------------------------------------------------------------------*/

static void on_heartbeat(const uint8_t *data, size_t len)
{
    if (len < sizeof(pkt_heartbeat_t) - 2u) {
        return;
    }

    const pkt_heartbeat_t *pkt = (const pkt_heartbeat_t *)data;

    last_heartbeat_tick = HAL_GetTick();

    if (pkt->emergency_requested) {
        Emergency_SetState(1);
    }
    if (pkt->emergency_release_requested) {
        /* Only clear emergency if no physical sensor is still asserted.
         * Firmware is the sole safety authority — never bypass hardware. */
        if (!Emergency_StopButtonYellow() && !Emergency_StopButtonWhite() &&
            !Emergency_WheelLiftBlue() && !Emergency_WheelLiftRed() &&
            !Emergency_Tilt() && !Emergency_LowZAccelerometer()) {
            Emergency_SetState(0);
        } else {
            debug_printf("emergency release rejected: physical sensor still active\r\n");
        }
    }
}

static void on_cmd_vel(const uint8_t *data, size_t len)
{
    if (len < sizeof(pkt_cmd_vel_t) - 2u) {
        return;
    }

