yannlossouarn/mowglinext/firmware/stm32/ros_usbnode/src/ros/ros_custom/cpp_main.cpp
/* on_hl_state blade LED feedback (moved out of on_hl_state for clarity) */
static void update_blade_led(void)
{
    if (target_blade_on_off) {
        #ifdef PANEL_LED_2H
        if (BLADEMOTOR_bActivated) {
            PANEL_Set_LED(PANEL_LED_2H, PANEL_LED_FLASH_SLOW);
        } else {
            PANEL_Set_LED(PANEL_LED_2H, PANEL_LED_ON);
        }
        #endif
    } else {
        #ifdef PANEL_LED_2H
        PANEL_Set_LED(PANEL_LED_2H, PANEL_LED_OFF);
        #endif
    }
}

/* ---------------------------------------------------------------------------
 * USB CDC receive callback — feeds COBS layer
 * ---------------------------------------------------------------------------*/
uint8_t CDC_DataReceivedHandler(const uint8_t *Buf, uint32_t len)
{
    mowgli_comms_process_rx(Buf, (size_t)len);
    return CDC_RX_DATA_HANDLED;
}

/* ---------------------------------------------------------------------------
 * usb_cdc_transmit — required by mowgli_comms.c
 * ---------------------------------------------------------------------------*/
void usb_cdc_transmit(const uint8_t *buf, size_t len)
{
    CDC_Transmit(buf, (uint32_t)len);
}

/* ---------------------------------------------------------------------------
 * LED blink + reboot handler (replaces chatter_handler)
 * ---------------------------------------------------------------------------*/
extern "C" void chatter_handler()
{
    if (NBT_handler(&led_nbt)) {
        HAL_GPIO_TogglePin(LED_GPIO_PORT, LED_PIN);

        if (reboot_flag) {
            NVIC_SystemReset();
        }
    }
}

/* Static-friction breakaway feedforward. When commanding motion, bias an
 * open-loop PWM term by sign(target) * g_drive_deadband_pwm so the wheel
 * crosses the PAC5210 breakaway immediately instead of waiting for a loop to
 * wind up. No bias when the target is ~0 (a stopped wheel stays stopped). */
static inline float apply_deadband_ff(float pwm, float target_mps)
{
    const float db = g_drive_deadband_pwm;
    if (db > 0.0f && fabsf(target_mps) > 1.0e-3f) {
        pwm += (target_mps > 0.0f) ? db : -db;
    }
    return pwm;
}

/* Position-hold corrective PWM for one wheel from its tick error (latched
 * reference minus current). A small deadzone avoids buzzing on encoder
 * quantization; the breakaway supplies the static-friction floor so even a
 * one-tick error can push back, and hold_kp scales the rest. Clamped well
 * under the motion PWM range. */
static inline int16_t hold_pwm(int32_t err_ticks)
{
    if (err_ticks > -HOLD_TOL_TICKS && err_ticks < HOLD_TOL_TICKS) {
        return 0;
    }
    const float floor_pwm = (err_ticks > 0) ? g_drive_deadband_pwm : -g_drive_deadband_pwm;
    float pwm = floor_pwm + g_hold_kp * (float)err_ticks;
    if (pwm > HOLD_MAX_PWM) {
        pwm = HOLD_MAX_PWM;
    }
    if (pwm < -HOLD_MAX_PWM) {
        pwm = -HOLD_MAX_PWM;
    }
    return (int16_t)pwm;
}

/* ---------------------------------------------------------------------------
 * Drive & blade motors handler
 * ---------------------------------------------------------------------------*/
extern "C" void motors_handler()
{
    if (NBT_handler(&motors_nbt)) {
        /* Snapshot ISR-written variables under interrupt lock */
        __disable_irq();
        float    snap_left_target  = left_target_mps;
        float    snap_right_target = right_target_mps;
        uint8_t  snap_target_blade = target_blade_on_off;
        uint32_t snap_heartbeat    = last_heartbeat_tick;
        uint32_t snap_cmd_vel      = last_cmd_vel_tick;
        __enable_irq();

        blade_on_off = snap_target_blade;

        /* --- decide effective target ---
         * Emergency or cmd_vel watchdog timeout overrides to a hard stop.
         * Otherwise the snapshot value drives the PI loop below. */
        bool hard_stop = false;
        if (Emergency_State()) {
            hard_stop = true;
            blade_on_off = 0;
        } else if (main_eOpenmowerStatus == OPENMOWER_STATUS_IDLE) {
            /* Re-assert the IDLE gate HERE — in the one place that actually
             * drives the wheels AND the blade — so the "never move / never
             * spin the blade while idle/docked" guarantee holds regardless of
             * the relative arrival order of CMD_PWM, CMD_BLADE and HL_STATE.
             * on_hl_state zeroes the targets when the IDLE packet arrives, but
             * a CMD_BLADE(on=1) arriving AFTER it would otherwise re-arm the
             * blade with no gate (on_cmd_blade is fire-and-forget). Firmware is
             * the sole blade safety authority. */
            hard_stop = true;
            blade_on_off = 0;
        } else {
            const uint32_t cmd_vel_age_ms = HAL_GetTick() - snap_cmd_vel;
            if (cmd_vel_age_ms > 200u) {
                /* Command-vel watchdog: zero motors if the host hasn't
                 * sent a twist in 200 ms (Pi hang, USB glitch, etc). */
                hard_stop = true;
            }
            if (cmd_vel_age_ms > 25000u) {
                blade_on_off = 0;
            }
        }

        const float l_target = hard_stop ? 0.0f : snap_left_target;
        const float r_target = hard_stop ? 0.0f : snap_right_target;

        /* Standstill position hold. While actively controlled (not hard_stop,
         * i.e. not IDLE / emergency / cmd_vel watchdog) and commanded to ~0 on
         * both wheels, latch the encoder position and push back against creep
         * instead of coasting. Mutually exclusive with the velocity loop so the
         * PI state stays clean across the hold. Released to coast by hard_stop
         * (the "really idle" paths) below. */
        static bool was_holding = false;
        static int32_t hold_l_ref = 0;
        static int32_t hold_r_ref = 0;
        const bool want_hold = (g_hold_enabled != 0u) && !hard_stop &&
                               fabsf(l_target) < 1.0e-3f && fabsf(r_target) < 1.0e-3f;

      if (want_hold) {
        const int32_t cur_l = left_ticks_signed;
        const int32_t cur_r = right_ticks_signed;
        if (!was_holding) {
            hold_l_ref = cur_l;
            hold_r_ref = cur_r;
            // Drop velocity-loop state so it resumes clean when hold releases.
            left_wheel_pid.resetIntegral();
            left_wheel_pid.resetDerivative();
            right_wheel_pid.resetIntegral();
            right_wheel_pid.resetDerivative();
            prev_left_target_mps = 0.0f;
            prev_right_target_mps = 0.0f;
            prev_left_ticks_signed_pi = cur_l;
            prev_right_ticks_signed_pi = cur_r;
            was_holding = true;
        }
        left_pwm_signed = hold_pwm(hold_l_ref - cur_l);
        right_pwm_signed = hold_pwm(hold_r_ref - cur_r);
      } else if (g_use_wheel_pi) {
        was_holding = false;
        /* Wheel-level PI loop.
         *
         * Reads the signed cumulative encoder count maintained by
         * drivemotor.c, derives actual_mps over the 20 ms loop
         * period, computes a feedforward + PI PWM. With the deadband
         * breakaway feedforward (g_drive_deadband_pwm) the integrator no
         * longer has to wind up to cross the static-friction deadband — the
         * breakaway PWM is applied immediately — so the PI only trims the
         * residual velocity error, eliminating the stick-slip lurch. When the
         * breakaway is 0 (default) the integrator still bridges the deadband
         * the old way.
         *
         * Read left_ticks_signed/right_ticks_signed directly (these are
         * 32-bit and updated from the drivemotor rx-decode path —
         * not strictly atomic, but a torn read here costs at most
         * one 20 ms loop of incorrect velocity, then converges). */
        const int32_t cur_left_ticks  = left_ticks_signed;
        const int32_t cur_right_ticks = right_ticks_signed;
        const int32_t dleft_ticks  = cur_left_ticks  - prev_left_ticks_signed_pi;
        const int32_t dright_ticks = cur_right_ticks - prev_right_ticks_signed_pi;
        prev_left_ticks_signed_pi  = cur_left_ticks;
        prev_right_ticks_signed_pi = cur_right_ticks;

        const float l_actual_mps =
            ((float)dleft_ticks)  / WHEEL_PI_TICKS_PER_M / WHEEL_PI_DT_S;
        const float r_actual_mps =
            ((float)dright_ticks) / WHEEL_PI_TICKS_PER_M / WHEEL_PI_DT_S;

        /* Reset the integrator on direction reversal / stop-to-go / hard-stop.
         * Without this the integral built up while decelerating would drive the
         * motor backwards as soon as the chassis stopped (micro-oscillation). */
        const bool l_target_sign_changed =
            (l_target * prev_left_target_mps  < 0.0f) ||
            (l_target == 0.0f && prev_left_target_mps  != 0.0f) ||
            hard_stop;
        const bool r_target_sign_changed =
            (r_target * prev_right_target_mps < 0.0f) ||
            (r_target == 0.0f && prev_right_target_mps != 0.0f) ||
            hard_stop;
        if (l_target_sign_changed) {
            left_wheel_pid.resetIntegral();
            left_wheel_pid.resetDerivative();
        }
        if (r_target_sign_changed) {
            right_wheel_pid.resetIntegral();
            right_wheel_pid.resetDerivative();
        }
        prev_left_target_mps  = l_target;
        prev_right_target_mps = r_target;

        /* Conditional-integration anti-windup, DIRECTION-AWARE: freeze the
         * integrator only in the direction that would worsen an already-
         * saturated output; always allow it to unwind OUT of saturation. Keying
         * on the error sign (not just the saturation bit) avoids a one-
         * directional integral latch — e.g. on overspeed (err < 0) while the
         * output is railed high, the integrator must still be able to wind down
         * to cut PWM. *_pwm_signed is the previous cycle's total (feedforward +
         * trim), saturated by DRIVEMOTOR_SetSpeedSigned at ±255. This sits on
         * top of the PID's own ±100 integral-magnitude clamp. */
        const float l_err = l_target - l_actual_mps;
        const float r_err = r_target - r_actual_mps;
        const bool l_update_integral =
            !((left_pwm_signed >= 255 && l_err > 0.0f) || (left_pwm_signed <= -255 && l_err < 0.0f));
        const bool r_update_integral =
            !((right_pwm_signed >= 255 && r_err > 0.0f) || (right_pwm_signed <= -255 && r_err < 0.0f));

        /* Closed-loop PI trim (Kp·err + integrator; D gain = 0). The PID
         * computes error = setpoint − feedback internally and integrates AFTER
         * forming the output (PX4 form), so a fresh integral increment reaches
         * the actuator one 50 Hz cycle later than the old integrate-before form
         * — steady-state identical, ~20 ms transient shift (immaterial here). */
        left_wheel_pid.setSetpoint(l_target);
        right_wheel_pid.setSetpoint(r_target);
        const float l_trim = left_wheel_pid.update(l_actual_mps, WHEEL_PI_DT_S, l_update_integral);
        const float r_trim = right_wheel_pid.update(r_actual_mps, WHEEL_PI_DT_S, r_update_integral);

        /* Open-loop feedforward (velocity->PWM scale + static-friction
         * breakaway) + closed-loop PI trim. Sign carried through. */
        const float l_pwm_f = apply_deadband_ff(l_target * g_pwm_per_mps, l_target) + l_trim;
        const float r_pwm_f = apply_deadband_ff(r_target * g_pwm_per_mps, r_target) + r_trim;

        /* When the target is exactly zero AND we're not braking from a
         * larger speed, force PWM to zero outright — avoids the residual
         * "hum" from a non-zero integral applied to a stopped wheel. */
        left_pwm_signed  = (l_target == 0.0f && fabsf(l_actual_mps) < 0.02f)
                          ? 0
                          : (int16_t)l_pwm_f;
        right_pwm_signed = (r_target == 0.0f && fabsf(r_actual_mps) < 0.02f)
                          ? 0
                          : (int16_t)r_pwm_f;
      } else {
        was_holding = false;
        /* Open-loop feedforward only (no encoder feedback, no integrator):
         * velocity->PWM scale plus the static-friction breakaway feedforward,
         * which is what lets a sub-deadband target still reach the wheels in
         * this mode instead of buzzing below breakaway. */
        left_pwm_signed  = (int16_t)apply_deadband_ff(l_target * g_pwm_per_mps, l_target);
        right_pwm_signed = (int16_t)apply_deadband_ff(r_target * g_pwm_per_mps, r_target);
      }

