yannlossouarn/mowglinext/firmware/stm32/ros_usbnode/src/ros/ros_custom/cpp_main.cpp
    // Low-passed |residual| with a short debounce so a single noisy frame can't
    // raise the flag, but a sustained disagreement does within ~60 ms.
    static float resid_ema = 0.0f;
    static uint8_t yaw_count = 0u;
    static uint8_t stall_count = 0u;
    resid_ema += SLIP_EMA_ALPHA * (fabsf(wheel_yaw - gyro_yaw) - resid_ema);
    if (resid_ema > SLIP_YAW_THRESH_RPS) {
        if (yaw_count < SLIP_YAW_PERSIST) {
            yaw_count++;
        }
    } else {
        yaw_count = 0u;
    }

    // Stall: a meaningful forward/turn command but the wheels aren't moving.
    const float cmd = (fabsf(left_target_mps) + fabsf(right_target_mps)) * 0.5f;
    const float meas = (fabsf(v_l) + fabsf(v_r)) * 0.5f;
    if (cmd > STALL_CMD_MPS && meas < STALL_MEAS_MPS) {
        if (stall_count < STALL_PERSIST) {
            stall_count++;
        }
    } else {
        stall_count = 0u;
    }

    uint8_t flags = 0u;
    if (yaw_count >= SLIP_YAW_PERSIST) {
        flags |= DRIVE_SLIP_FLAG_YAW;
    }
    if (stall_count >= STALL_PERSIST) {
        flags |= DRIVE_SLIP_FLAG_STALL;
    }

    g_wheel_yaw_mrad_s = (int16_t)pid_constrain(wheel_yaw * 1000.0f, -32767.0f, 32767.0f);
    g_imu_yaw_mrad_s = (int16_t)pid_constrain(gyro_yaw * 1000.0f, -32767.0f, 32767.0f);
    g_slip_flags = flags;
}

/* ---------------------------------------------------------------------------
 * IMU + status broadcast handler
 * ---------------------------------------------------------------------------*/
extern "C" void broadcast_handler()
{
    if (NBT_handler(&imu_nbt)) {
        pkt_imu_t imu_pkt;
        imu_pkt.type = PKT_ID_IMU;

        static uint32_t last_imu_tick = 0;
        uint32_t now_tick = HAL_GetTick();
        imu_pkt.dt_millis = (uint16_t)(now_tick - last_imu_tick);
        last_imu_tick = now_tick;

#ifdef EXTERNAL_IMU_ACCELERATION
        float ax, ay, az;
        IMU_ReadAccelerometer(&ax, &ay, &az);
        imu_pkt.acceleration_mss[0] = ax;
        imu_pkt.acceleration_mss[1] = ay;
        imu_pkt.acceleration_mss[2] = az;
#else
        imu_pkt.acceleration_mss[0] = 0.0f;
        imu_pkt.acceleration_mss[1] = 0.0f;
        imu_pkt.acceleration_mss[2] = 0.0f;
#endif

#ifdef EXTERNAL_IMU_ANGULAR
        float gx, gy, gz;
        IMU_ReadGyro(&gx, &gy, &gz);
        imu_pkt.gyro_rads[0] = gx;
        imu_pkt.gyro_rads[1] = gy;
        imu_pkt.gyro_rads[2] = gz;
        g_imu_gyro_z = gz;  // feed the IMU-to-odometry discrepancy detector
#else
        imu_pkt.gyro_rads[0] = 0.0f;
        imu_pkt.gyro_rads[1] = 0.0f;
        imu_pkt.gyro_rads[2] = 0.0f;
#endif

        // Magnetometer — uses generic IMU_ReadMag (works with any IMU that has mag)
        IMU_ReadMag(&imu_pkt.mag_uT[0], &imu_pkt.mag_uT[1], &imu_pkt.mag_uT[2]);

        mowgli_comms_send_imu(&imu_pkt);
    }

    if (NBT_handler(&status_nbt)) {
        pkt_status_t status_pkt;
        status_pkt.type = PKT_ID_STATUS;

        // Build status bitmask
        uint8_t status_bits = STATUS_BIT_INITIALIZED | STATUS_BIT_RASPI_POWER;
        if (chargecontrol_is_charging) {
            status_bits |= STATUS_BIT_CHARGING;
        }
        if (RAIN_Sense()) {
            status_bits |= STATUS_BIT_RAIN;
        }
        // Sound and UI availability from panel
        status_bits |= STATUS_BIT_UI_AVAIL;
        status_pkt.status_bitmask = status_bits;

        // USS ranges — fill from ultrasonic sensors
        for (unsigned int i = 0; i < MOWGLI_USS_COUNT; i++) {
            status_pkt.uss_ranges_m[i] = 0.0f;
        }
#if OPTION_ULTRASONIC == 1
        status_pkt.uss_ranges_m[0] = (float)(ULTRASONICSENSOR_u32GetLeftDistance()) / 10000.0f;
        status_pkt.uss_ranges_m[1] = (float)(ULTRASONICSENSOR_u32GetRightDistance()) / 10000.0f;
#endif

        // Emergency bitmask
        uint8_t emergency_bits = 0u;
        if (Emergency_State()) {
            emergency_bits |= EMERGENCY_BIT_LATCH;
            if (Emergency_StopButtonYellow() || Emergency_StopButtonWhite()) {
                emergency_bits |= EMERGENCY_BIT_STOP;
            }
            if (Emergency_WheelLiftBlue() || Emergency_WheelLiftRed()) {
                emergency_bits |= EMERGENCY_BIT_LIFT;
            }
        }
        status_pkt.emergency_bitmask = emergency_bits;

        // Power
        status_pkt.v_charge         = charge_voltage;
        status_pkt.v_system         = battery_voltage;
        status_pkt.charging_current = current;
        status_pkt.batt_percentage  = 0;  // TODO: compute from voltage curve

        mowgli_comms_send_status(&status_pkt);
    }

    // Blade motor status (4 Hz) — only after system has initialized
    if (NBT_handler(&blade_nbt) && last_heartbeat_tick != 0u) {
        pkt_blade_status_t blade_pkt;
        memset(&blade_pkt, 0, sizeof(blade_pkt));
        blade_pkt.type        = PKT_ID_BLADE_STATUS;
        blade_pkt.is_active   = BLADEMOTOR_bActivated ? 1u : 0u;
        blade_pkt.rpm         = BLADEMOTOR_u16RPM;
        blade_pkt.power_watts = BLADEMOTOR_u16Power;
        blade_pkt.temperature = blade_temperature;
        blade_pkt.error_count = BLADEMOTOR_u32Error;
        mowgli_comms_send(&blade_pkt, sizeof(blade_pkt));
    }
}

/* ---------------------------------------------------------------------------
 * spinOnce — no-op (rosserial spin removed)
 * ---------------------------------------------------------------------------*/
extern "C" void spinOnce()
{
    // Nothing to do — COBS RX is handled in CDC_DataReceivedHandler().
    // This function is kept so main.c doesn't need modification.
}

/* ---------------------------------------------------------------------------
 * Initialisation (replaces init_ROS)
 * ---------------------------------------------------------------------------*/
extern "C" void init_ROS()
{
    // Initialise COBS comms layer
    mowgli_comms_init();

    // Register handlers for Host -> Firmware packets
    mowgli_comms_register_handler(PKT_ID_HEARTBEAT, on_heartbeat);
    mowgli_comms_register_handler(PKT_ID_CMD_VEL,   on_cmd_vel);
    mowgli_comms_register_handler(PKT_ID_HL_STATE,  on_hl_state);
    mowgli_comms_register_handler(PKT_ID_CMD_BLADE, on_cmd_blade);
    mowgli_comms_register_handler(PKT_ID_REBOOT,    on_reboot);
    mowgli_comms_register_handler(PKT_ID_SET_DRIVE_PID, on_set_drive_pid);

    // Initialise timers
    NBT_init(&led_nbt,     LED_NBT_TIME_MS);
    NBT_init(&panel_nbt,   PANEL_NBT_TIME_MS);
    NBT_init(&status_nbt,  STATUS_NBT_TIME_MS);
    NBT_init(&imu_nbt,     IMU_NBT_TIME_MS);
    NBT_init(&motors_nbt,  MOTORS_NBT_TIME_MS);
    NBT_init(&blade_nbt,   BLADE_NBT_TIME_MS);

    // Per-wheel velocity PI gains/limits (vendored PX4 PID, pid.hpp). D=0 — no
    // derivative on a velocity loop. Gains/limits are in PWM units, matching the
    // hand-rolled loop they replace (Kp·err + integrator, integral clamp ±100,
    // output clamp ±255). The PID adds derivative-on-measurement (unused at D=0)
    // and conditional-integration anti-windup. Always initialised (not gated on
    // the compile-time default) because g_use_wheel_pi can enable the loop at
    // runtime via PKT_ID_SET_DRIVE_PID — uninitialised gains would be zero.
    left_wheel_pid.setGains(WHEEL_PI_KP_PWM_PER_MPS, WHEEL_PI_KI_PWM_PER_MPS_S, 0.0f);
    left_wheel_pid.setIntegralLimit(WHEEL_PI_INT_MAX_PWM);
    left_wheel_pid.setOutputLimit(255.0f);
    right_wheel_pid.setGains(WHEEL_PI_KP_PWM_PER_MPS, WHEEL_PI_KI_PWM_PER_MPS_S, 0.0f);
    right_wheel_pid.setIntegralLimit(WHEEL_PI_INT_MAX_PWM);
    right_wheel_pid.setOutputLimit(255.0f);

    last_odom_tick      = HAL_GetTick();
    last_heartbeat_tick = 0;
    last_cmd_vel_tick   = 0;
}

float clamp(float d, float min, float max)
{
    const float t = d < min ? min : d;
    return t > max ? max : t;
}
